import pandas as pd
import pytest


@pytest.fixture
def sample_transactions_for_reports():
    """Фикстура с тестовыми данными транзакций"""
    data = {
        "Дата платежа": ["01.01.2023", "15.02.2023", "10.03.2023", "05.04.2023", "20.05.2023", "08.03.2025"],
        "Категория": ["Еда", "Транспорт", "Еда", "Развлечения", "Еда", "Еда"],
        "Сумма операции": [100, 200, 150, 300, 250, 200]
    }
    return pd.DataFrame(data)

@pytest.fixture
def sample_transactions_with_nan():
    """Фикстура с тестовыми данными транзакций, содержащими NaN"""
    data = {
        "Дата платежа": ["01.01.2023", "15.02.2023", "10.03.2023", "05.04.2023"],
        "Категория": ["Еда", None, "Еда", "Развлечения"],
        "Сумма операции": [100, None, 150, 300]
    }
    return pd.DataFrame(data)

@pytest.fixture
def sample_transactions_for_services():
    """Фикстура с тестовыми данными транзакций"""
    return [
        {"Категория": "переводы", "Описание": "Иванов И.И. перевод денег"},
        {"Категория": "переводы", "Описание": "Петров П.П. оплата"},
        {"Категория": "еда", "Описание": "Магазин Пятерочка"},
        {"Категория": "переводы", "Описание": "Сидоров С.С. возврат долга"},
        {"Категория": "переводы", "Описание": "Некорректное описание"},
        {"Категория": None, "Описание": "Без категории"},
        {"Категория": "переводы", "Описание": 12345},  # Числовое описание
    ]


@pytest.fixture
def empty_transactions():
    """Фикстура с пустым списком транзакций"""
    return []